; domain
(define (domain restaurantB)
	(:requirements :strips :adl :typing :fluents)
	
	(:types 
        robot - object
        customer - object
        plate - object
        location
	)

	(:predicates
		(at ?obj - object ?loc - location)
		(adjacent ?loc1 - location ?loc2 - location)
		(hasFood ?p - plate)
		(hasPlate ?r - robot)
		(holding ?r - robot ?p - plate)
		(served ?c - customer)
		(buffet ?loc - location)
	)

	(:action pick-up
		:parameters (?r - robot ?p - plate ?loc - location)
		:precondition (and
			(at ?r ?loc)
			(at ?p ?loc)
			(not (hasPlate ?r))
		)
		:effect (and
			(holding ?r ?p)
			(hasPlate ?r)
			(not (at ?p ?loc))
		)
	)

	(:action present
		:parameters (?r - robot ?p - plate ?loc - location ?c - customer)
		:precondition (and
			(at ?c ?loc)
			(at ?r ?loc)
			(holding ?r ?p)
			(hasFood ?p)
			(not (served ?c))
		)
		:effect (and
			(served ?c)
			(not (holding ?r ?p))
			(not (hasPlate ?r))
			(at ?p ?loc)
		)
	)

	(:action fill
		:parameters (?r - robot ?p - plate ?loc - location)
		:precondition (and
			(at ?r ?loc)
			(buffet ?loc)
			(holding ?r ?p)
			(not (hasFood ?p))
		)
		:effect (and
			(hasFood ?p)
		)
	)

	(:action move
		:parameters (?r - robot ?loc1 - location ?loc2 - location)
		:precondition (and
			(at ?r ?loc1)
			(adjacent ?loc1 ?loc2)
		)
		:effect (and
			(at ?r ?loc2)
			(not (at ?r ?loc1))
		)
	)
)

; problem
(define (problem problem1)
  (:domain restaurantB)
  
  ;; Define objects

  (:objects
    robot - robot
    plate1 - plate
    customer1 - customer
    BTA AMA AUA PLA PMA PUA ALA - location
  )
  
  (:init

    ;; Robot initialization

    (at robot AUA)

    ;; Plate initialization

    (at plate1 PLA)

    ;; Customer initialization

    (at customer1 PLA)

    ;; Define adjacent rooms

    (adjacent BTA AUA) (adjacent AUA BTA)
    (adjacent AUA AMA) (adjacent AMA AUA)
    (adjacent AUA PUA) (adjacent PUA AUA)
    (adjacent PUA PMA) (adjacent PMA PUA)
    (adjacent PMA PLA) (adjacent PLA PMA)
    (adjacent AMA ALA) (adjacent ALA AMA)
    (adjacent PLA ALA) (adjacent ALA PLA)

    ;; Specify in which room the buffet is located
    (buffet BTA)
  )
  
  ;; Define the goal state

  (:goal
    (and 
        (at robot PUA)
        (served customer1)
    )
  )
)

; plan
1. (move robot aua ama)
   deleted: (at robot aua)
   added: (at robot ama)
   goals met: 0 of 2
2. (move robot ama ala)
   deleted: (at robot ama)
   added: (at robot ala)
   goals met: 0 of 2
3. (move robot ala pla)
   deleted: (at robot ala)
   added: (at robot pla)
   goals met: 0 of 2
4. (pick-up robot plate1 pla)
   deleted: (at plate1 pla)
   added: (holding robot plate1) (hasplate robot)
   goals met: 0 of 2
5. (move robot pla pma)
   deleted: (at robot pla)
   added: (at robot pma)
   goals met: 0 of 2
6. (move robot pma pua)
   deleted: (at robot pma)
   added: (at robot pua)
   goals met: 1 of 2
7. (move robot pua aua)
   deleted: (at robot pua)
   added: (at robot aua)
   goals met: 0 of 2
8. (move robot aua bta)
   deleted: (at robot aua)
   added: (at robot bta)
   goals met: 0 of 2
9. (fill robot plate1 bta)
   added: (hasfood plate1)
   goals met: 0 of 2
10. (move robot bta aua)
   deleted: (at robot bta)
   added: (at robot aua)
   goals met: 0 of 2
11. (move robot aua ama)
   deleted: (at robot aua)
   added: (at robot ama)
   goals met: 0 of 2
12. (move robot ama ala)
   deleted: (at robot ama)
   added: (at robot ala)
   goals met: 0 of 2
13. (move robot ala pla)
   deleted: (at robot ala)
   added: (at robot pla)
   goals met: 0 of 2
14. (present robot plate1 pla customer1)
   deleted: (holding robot plate1) (hasplate robot)
   added: (served customer1) (at plate1 pla)
   goals met: 1 of 2
15. (move robot pla pma)
   deleted: (at robot pla)
   added: (at robot pma)
   goals met: 1 of 2
16. (move robot pma pua)
   deleted: (at robot pma)
   added: (at robot pua)
   goals met: 2 of 2
